# Taps
tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"

# Git and GitHub
brew "git"
brew "gh"
brew "git-standup"

# Node and package managers
brew "nvm"
brew "pnpm"
brew "yarn"

# Python
brew "pyenv"

# Shell and terminal
brew "zsh"
brew "stow"
brew "coreutils"
brew "oh-my-posh"
brew "lsd"
brew "tree"

# Cloud and DevOps
brew "awscli"
brew "flyctl"

# Miscellaneous
brew "jq"
brew "ffmpeg"
brew "fastfetch"

# -------------------------
# Casks
# -------------------------

# Daily
cask "raycast"
cask "1password"
cask "bitwarden"
cask "spotify"

# Browsers
cask "arc"
cask "firefox"
cask "google-chrome"
cask "brave-browser"

# Development
cask "orbstack"
cask "postman"
cask "ngrok"
cask "warp"
cask "visual-studio-code"
cask "visual-studio-code@insiders"

# Messaging
cask "zoom"
cask "slack"

# Fonts
cask "font-hasklug-nerd-font"
cask "font-lilex-nerd-font"
cask "font-monaspace"

# Design
cask "figma"

# Miscellaneous
cask "appcleaner"
cask "aerospace"
cask "cap"

# VSCode Extensions
vscode "astro-build.astro-vscode"
vscode "attilabuti.vscode-mjml"
vscode "bradlc.vscode-tailwindcss"
vscode "bruceyuhb.hsl-preview"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-workspace"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "includable.file-duplicate"
vscode "inlang.vs-code-extension"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mikestead.dotenv"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "ue.alphabetical-sorter"
vscode "v4run.transpose"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "yoavbls.pretty-ts-errors"
